<?php

return [
    // 定数定義
    // 間取りマスター
    'layout' => [
        10 => '1K',
        11 => '1DK',
        12 => '1LDK',
        20 => '2K',
        21 => '2DK',
        22 => '2LDK',
        30 => '3K',
        31 => '3DK',
        32 => '3LDK',
        40 => '4K',
        41 => '4DK',
        42 => '4LDK',
        50 => '5K',
        51 => '5DK',
        52 => '5LDK',
        99 => 'それ以上',
    ],
    // 構造工法マスタ
    'structure' => [
        1 => "木造軸組工法（在来）",
        2 => "木造枠組壁工法（ツーバイ)",
        3 => "鉄骨造",
        4 => "木質系プレハブ",
        5 => "鉄骨系プレハブ",
        6 => "RC（鉄筋コンクリート）造",
        7 => "その他（独自認定工法等）",
    ],
    // 会員区分
    'membership' => [
        'visitor' => 1,
        'owner' => 2,
    ],

    // request_status
    'request_status' => [
        0 => '承認待ち'  ,           // '工務店未承認'
        1 => 'マッチング不成立',    // '工務店拒否'
        2 => '承認待ち',           // 'オーナー未承認'
        3 => 'マッチング不成立',    // 'オーナー拒否'
        4 => 'マッチング成立',      // '承認済'
        5 => 'マッチング成立',      // '見学48時間前'
        6 => 'マッチング成立',      // '見学24時間前'
        7 => 'キャンセル',          // '見学キャンセル'
        8 => '見学不実施',          // '見学不実施'
        9 => '完了',                // '見学完了'
        10 => '完了',               // '見学完了'
        11 => '完了',               // '成約申請中'
        12 => '完了',               // '成約申請中'
        13 => '完了',               // '成約済'
    ],

    // 性別
    'sex' => [
        1 => '男性',
        2 => '女性',
    ],

    'image_domain' => env('IMAGE_DOMAIN'),
    'email_admin' => env('EMAIL_ADMIN'),
];
